/* Copyright (C) 2005-2025, UNIGINE. All rights reserved.
*
* This file is a part of the UNIGINE 2 SDK.
*
* Your use and / or redistribution of this software in source and / or
* binary form, with or without modification, is subject to: (i) your
* ongoing acceptance of and compliance with the terms and conditions of
* the UNIGINE License Agreement; and (ii) your inclusion of this notice
* in any version of this software that you use or redistribute.
* A copy of the UNIGINE License Agreement is available by contacting
* UNIGINE. at http://unigine.com/
*/
#pragma once

#include "UnigineBase.h"
#include "UnigineVector.h"
#include <UnigineTimer.h>

#ifdef _WIN32
	#include <intrin.h>
#elif _LINUX || UNIGINE_PS5
	#include <pthread.h>
	#include <unistd.h>
#else
	#error "Platform unsupported"
#endif

#include <xmmintrin.h>
#include <stdint.h>

namespace Unigine
{

class UNIGINE_API CPUShader;
class UNIGINE_API PoolCPUShaders;

//////////////////////////////////////////////////////////////////////////
/// Atomics and locks.
//////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////
/// AtomicGet
//////////////////////////////////////////////////////////////////////////

/// Atomic read, 8-bit.
/// Because simply accessing the variable directly is actually unsafe!
UNIGINE_INLINE char AtomicGet(const volatile char *ptr) noexcept
{
	#ifdef _WIN32
		char value = *ptr;
		_ReadWriteBarrier();

//////////////////////////////////////////////////////////////////////////
/// AtomicSet
//////////////////////////////////////////////////////////////////////////

/// Atomic set, 8-bit.
UNIGINE_INLINE void AtomicSet(volatile char *ptr, char value) noexcept
{
	#ifdef _WIN32
		_ReadWriteBarrier();
		*ptr = value;
	#else
		__atomic_store_n(ptr, value, __ATOMIC_RELEASE);
	#endif
}

/// Atomic set, 8-bit.
UNIGINE_INLINE void AtomicSet(volatile bool *ptr, bool value) noexcept
{
	AtomicSet(reinterpret_cast<volatile char *>(ptr), char(value));
}

/// Atomic set, 16-bit.
UNIGINE_INLINE void AtomicSet(volatile short *ptr, short value) noexcept
{
	#ifdef _WIN32
		_ReadWriteBarrier();
		*ptr = value;
	#else
		__atomic_store_n(ptr, value, __ATOMIC_RELEASE);
	#endif
}

/// Atomic set, 32-bit.
UNIGINE_INLINE void AtomicSet(volatile int *ptr, int value) noexcept
{
	#ifdef _WIN32
		_ReadWriteBarrier();
		*ptr = value;
	#else
		__atomic_store_n(ptr, value, __ATOMIC_RELEASE);
	#endif
}

/// Atomic set, 64-bit.
UNIGINE_INLINE void AtomicSet(volatile long long *ptr, long long value) noexcept
{
	#ifdef _WIN32
		_ReadWriteBarrier();
		*ptr = value;
	#else
		__atomic_store_n(ptr, value, __ATOMIC_RELEASE);
	#endif
}

//////////////////////////////////////////////////////////////////////////
/// AtomicSwap
//////////////////////////////////////////////////////////////////////////

/// Atomic swap, 8-bit.
/// Returns the previous value.
UNIGINE_INLINE char AtomicSwap(volatile char *ptr, char value) noexcept
{
	#ifdef _WIN32
		return _InterlockedExchange8(ptr, value);
	#else
		return __atomic_exchange_n(ptr, value, __ATOMIC_ACQ_REL);
	#endif
}

/// Atomic swap, 8-bit.
/// Returns the previous value.
UNIGINE_INLINE bool AtomicSwap(volatile bool *ptr, bool value) noexcept
{
	return AtomicSwap(reinterpret_cast<volatile char *>(ptr), char(value)) != 0;
}

/// Atomic swap, 16-bit.
/// Returns the previous value.
UNIGINE_INLINE short AtomicSwap(volatile short *ptr, short value) noexcept
{
	#ifdef _WIN32
		return _InterlockedExchange16(ptr, value);
	#else
		return __atomic_exchange_n(ptr, value, __ATOMIC_ACQ_REL);
	#endif
}

/// Atomic swap, 32-bit.
/// Returns the previous value.
UNIGINE_INLINE int AtomicSwap(volatile int *ptr, int value) noexcept
{
	#ifdef _WIN32
		return _InterlockedExchange(reinterpret_cast<volatile long *>(ptr), value);
	#else
		return __atomic_exchange_n(ptr, value, __ATOMIC_ACQ_REL);
	#endif
}

/// Atomic swap, 64-bit.
/// Returns the previous value.
UNIGINE_INLINE long long AtomicSwap(volatile long long *ptr, long long value) noexcept
{
	#ifdef _WIN32
		return _InterlockedExchange64(ptr, value);
	#else
		return __atomic_exchange_n(ptr, value, __ATOMIC_ACQ_REL);
	#endif
}

//////////////////////////////////////////////////////////////////////////
/// AtomicCAS
//////////////////////////////////////////////////////////////////////////

/// Atomic CAS (Compare-And-Swap), 8-bit.
UNIGINE_INLINE bool AtomicCAS(volatile char *ptr, char old_value, char new_value) noexcept
{
	assert((((size_t)ptr) % (sizeof(char))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return AtomicGet(ptr) == old_value && (_InterlockedCompareExchange8(ptr, new_value, old_value) == old_value);
	#else
		return AtomicGet(ptr) == old_value && (__sync_val_compare_and_swap(ptr, old_value, new_value) == old_value);
	#endif
}

/// Atomic CAS (Compare-And-Swap), 16-bit.
UNIGINE_INLINE bool AtomicCAS(volatile short *ptr, short old_value, short new_value) noexcept
{
	assert((((size_t)ptr) % (sizeof(short))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return AtomicGet(ptr) == old_value && (_InterlockedCompareExchange16(ptr, new_value, old_value) == old_value);
	#else
		return AtomicGet(ptr) == old_value && (__sync_val_compare_and_swap(ptr, old_value, new_value) == old_value);
	#endif
}

/// Atomic CAS (Compare-And-Swap), 32-bit.
UNIGINE_INLINE bool AtomicCAS(volatile int *ptr, int old_value, int new_value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return AtomicGet(ptr) == old_value && (_InterlockedCompareExchange((volatile long *)ptr, new_value, old_value) == old_value);
	#else
		return AtomicGet(ptr) == old_value && (__sync_val_compare_and_swap(ptr, old_value, new_value) == old_value);
	#endif
}

/// Atomic CAS (Compare-And-Swap), 64-bit.
UNIGINE_INLINE bool AtomicCAS(volatile long long *ptr, long long old_value, long long new_value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return AtomicGet(ptr) == old_value && (_InterlockedCompareExchange64(ptr, new_value, old_value) == old_value);
	#else
		return AtomicGet(ptr) == old_value && (__sync_val_compare_and_swap(ptr, old_value, new_value) == old_value);
	#endif
}
/// Atomic CAS (Compare-And-Swap), pointer.
UNIGINE_INLINE bool AtomicCAS(void *volatile * ptr, void *old_value, void *new_value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return *ptr == old_value && (_InterlockedCompareExchangePointer(ptr, new_value, old_value) == old_value);
	#else
		return *ptr == old_value && (__sync_val_compare_and_swap(ptr, old_value, new_value) == old_value);
	#endif
}

//////////////////////////////////////////////////////////////////////////
/// AtomicAdd
//////////////////////////////////////////////////////////////////////////

/// Atomic add, 8-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE char AtomicAdd(volatile char *ptr, char value) noexcept
{
	assert((((size_t)ptr) % (sizeof(char))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedExchangeAdd8(ptr, value);
	#else
		return __sync_fetch_and_add(ptr, value);
	#endif
}

/// Atomic add, 16-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE short AtomicAdd(volatile short *ptr, short value) noexcept
{
	assert((((size_t)ptr) % (sizeof(short))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedExchangeAdd16(ptr, value);
	#else
		return __sync_fetch_and_add(ptr, value);
	#endif
}

/// Atomic add, 32-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE int AtomicAdd(volatile int *ptr, int value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedExchangeAdd((volatile long *)ptr, (long)value);
	#else
		return __sync_fetch_and_add(ptr, value);
	#endif
}

/// Atomic add, 64-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE long long AtomicAdd(volatile long long *ptr, long long value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedExchangeAdd64((volatile long long *)ptr, (long long)value);
	#else
		return __sync_fetch_and_add(ptr, value);
	#endif
}

//////////////////////////////////////////////////////////////////////////
/// AtomicInc
//////////////////////////////////////////////////////////////////////////

/// Atomic increment, 8-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE char AtomicInc(volatile char *ptr) noexcept
{
	return AtomicAdd(ptr, 1);
}

/// Atomic increment, 16-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE short AtomicInc(volatile short *ptr) noexcept
{
	return AtomicAdd(ptr, 1);
}

/// Atomic increment, 32-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE int AtomicInc(volatile int *ptr) noexcept
{
	return AtomicAdd(ptr, 1);
}

/// Atomic increment, 64-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE long long AtomicInc(volatile long long *ptr) noexcept
{
	return AtomicAdd(ptr, 1);
}

//////////////////////////////////////////////////////////////////////////
/// AtomicDec
//////////////////////////////////////////////////////////////////////////

/// Atomic decrement, 8-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE char AtomicDec(volatile char *ptr) noexcept
{
	return AtomicAdd(ptr, -1);
}

/// Atomic increment, 16-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE short AtomicDec(volatile short *ptr) noexcept
{
	return AtomicAdd(ptr, -1);
}

/// Atomic increment, 32-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE int AtomicDec(volatile int *ptr) noexcept
{
	return AtomicAdd(ptr, -1);
}

/// Atomic increment, 64-bit.
/// Returns the previous value (just before adding).
UNIGINE_INLINE long long AtomicDec(volatile long long *ptr) noexcept
{
	return AtomicAdd(ptr, -1);
}

//////////////////////////////////////////////////////////////////////////
/// AtomicAnd
//////////////////////////////////////////////////////////////////////////

/// Atomic and, 8-bit.
/// Returns the previous value
UNIGINE_INLINE char AtomicAnd(volatile char *ptr, char value) noexcept
{
	assert((((size_t)ptr) % (sizeof(char))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedAnd8(ptr, value);
	#else
		return __sync_fetch_and_and(ptr, value);
	#endif
}

/// Atomic and, 16-bit.
/// Returns the previous value
UNIGINE_INLINE short AtomicAnd(volatile short *ptr, short value) noexcept
{
	assert((((size_t)ptr) % (sizeof(short))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedAnd16(ptr, value);
	#else
		return __sync_fetch_and_and(ptr, value);
	#endif
}

/// Atomic and, 32-bit.
/// Returns the previous value
UNIGINE_INLINE int AtomicAnd(volatile int *ptr, int value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedAnd((volatile long *)ptr, (long)value);
	#else
		return __sync_fetch_and_and(ptr, value);
	#endif
}

/// Atomic and, 64-bit.
/// Returns the previous value
UNIGINE_INLINE long long AtomicAnd(volatile long long *ptr, long long value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedAnd64((volatile long long *)ptr, (long long)value);
	#else
		return __sync_fetch_and_and(ptr, value);
	#endif
}

//////////////////////////////////////////////////////////////////////////
/// AtomicOr
//////////////////////////////////////////////////////////////////////////

/// Atomic or, 8-bit.
/// Returns the previous value
UNIGINE_INLINE char AtomicOr(volatile char *ptr, char value) noexcept
{
	assert((((size_t)ptr) % (sizeof(char))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedOr8(ptr, value);
	#else
		return __sync_fetch_and_or(ptr, value);
	#endif
}

/// Atomic or, 16-bit.
/// Returns the previous value
UNIGINE_INLINE short AtomicOr(volatile short *ptr, short value) noexcept
{
	assert((((size_t)ptr) % (sizeof(short))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedOr16(ptr, value);
	#else
		return __sync_fetch_and_or(ptr, value);
	#endif
}

/// Atomic or, 32-bit.
/// Returns the previous value
UNIGINE_INLINE int AtomicOr(volatile int *ptr, int value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedOr((volatile long *)ptr, (long)value);
	#else
		return __sync_fetch_and_or(ptr, value);
	#endif
}

/// Atomic or, 64-bit.
/// Returns the previous value
UNIGINE_INLINE long long AtomicOr(volatile long long *ptr, long long value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedOr64((volatile long long *)ptr, (long long)value);
	#else
		return __sync_fetch_and_or(ptr, value);
	#endif
}

//////////////////////////////////////////////////////////////////////////
/// AtomicXor
//////////////////////////////////////////////////////////////////////////

/// Atomic xor, 8-bit.
/// Returns the previous value
UNIGINE_INLINE char AtomicXor(volatile char *ptr, char value) noexcept
{
	assert((((size_t)ptr) % (sizeof(char))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedXor8(ptr, value);
	#else
		return __sync_fetch_and_xor(ptr, value);
	#endif
}

/// Atomic xor, 16-bit.
/// Returns the previous value
UNIGINE_INLINE short AtomicXor(volatile short *ptr, short value) noexcept
{
	assert((((size_t)ptr) % (sizeof(short))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedXor16(ptr, value);
	#else
		return __sync_fetch_and_xor(ptr, value);
	#endif
}

/// Atomic xor, 32-bit.
/// Returns the previous value
UNIGINE_INLINE int AtomicXor(volatile int *ptr, int value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedXor((volatile long *)ptr, (long)value);
	#else
		return __sync_fetch_and_xor(ptr, value);
	#endif
}

/// Atomic xor, 64-bit.
/// Returns the previous value
UNIGINE_INLINE long long AtomicXor(volatile long long *ptr, long long value) noexcept
{
	assert((((size_t)ptr) % (sizeof(int))) == 0 && "unaligned atomic!");
	#ifdef _WIN32
		return _InterlockedXor64((volatile long long *)ptr, (long long)value);
	#else
		return __sync_fetch_and_xor(ptr, value);
	#endif
}

//////////////////////////////////////////////////////////////////////////
/// Thread
//////////////////////////////////////////////////////////////////////////

/// Thread wrapper class.
class UNIGINE_API Thread
{
public:
	Thread(bool auto_shutdown = true);
	virtual ~Thread();

	// Runs the thread.
	// size argument accepts thread stack size in bytes.
	// Returns 1 if the thread was successfully run; otherwise, 0 is returned.
	virtual bool run(size_t size = 0x100000);

	// Stops the thread.
	// Returns 1 if the operation was a success; otherwise, 0 is returned.
	bool stop();

	// Signals the thread to wake up.
	void signal();

	// Terminates the thread.
	// Returns 1 if the operation was a success; otherwise, 0 is returned.
	bool terminate();

	// Shutdown the thread.
	// platform specific stop and terminate
	virtual bool shutdown();

	static void allThreadsShutdown();
	UNIGINE_INLINE static bool isShutdown() noexcept { return is_shutdown; }

	// Checks if the thread is running.
	// Returns 1 if the thread is running; otherwise, 0 is returned.
	UNIGINE_INLINE bool isRunning() const noexcept { return running && !is_shutdown; }

	// Checks if the thread is waiting.
	// Returns 1 if the thread is waiting; otherwise, 0 is returned.
	UNIGINE_INLINE bool isWaiting() const noexcept { return is_waiting && AtomicGet(&need_wait); }

	// Sets the thread priority.
	// Acceptable priority values are in the range [-3;3].
	// The default thread priority is 0.
	// Returns 1 if the operation was a success; otherwise, 0 is returned.
	int setPriority(int priority);

	// Returns the thread priority in range [-3;3].
	int getPriority() const;

	// Returns a platform specific thread
	UNIGINE_INLINE auto getThread() const noexcept { return thread; }

	// Sets thread's affinity mask
	int setAffinityMask(long long mask);

	// Returns thread's affinity mask
	// returns -1 if mask is not set.
	long long getAffinityMask() const;

	#ifdef _WIN32
		typedef unsigned long ID;
		UNIGINE_INLINE static ID getID() noexcept { return WinAPI::GetCurrentThreadId(); }
		// Suspends thread execution.
		// Timeout value is provided in milliseconds.
		UNIGINE_INLINE static void sleep(unsigned int ms) noexcept { WinAPI::Sleep(ms); }
		UNIGINE_INLINE static void switchThread() noexcept
		{
			_mm_pause();
			if (!WinAPI::SwitchToThread())
				WinAPI::Sleep(0);
		}
	#else
		typedef pthread_t ID;
		UNIGINE_INLINE static ID getID() noexcept { return pthread_self(); }
		UNIGINE_INLINE auto getThreadMutex() const noexcept { return mutex; }
		// Suspends thread execution.
		// Timeout value is provided in milliseconds.
		UNIGINE_INLINE static void sleep(unsigned int ms) noexcept { ::usleep(ms * 1000); }
		UNIGINE_INLINE static void switchThread() noexcept
		{
			_mm_pause();
			sched_yield();
		}
	#endif

	UNIGINE_INLINE static bool isMainThread() { return getID() == thread_main_id; }
	UNIGINE_INLINE static bool isGPUStreamThread() { return getID() == thread_gpu_stream_id; }
	UNIGINE_INLINE static bool isFileStreamThread() { return getID() == thread_file_stream_id; }
	UNIGINE_INLINE static bool isAsyncThread() { return getID() == thread_async_id; }
	UNIGINE_INLINE static bool isBackgroundThread() { return getID() == thread_background_id; }
	UNIGINE_INLINE static bool isAsyncRenderThread() { return getID() == async_render_id; }
	static bool isPoolCPUShaderThread();

	UNIGINE_INLINE ID getRunningID() const noexcept { return thread_id; }
	// Returns the current thread identifier.
	UNIGINE_INLINE bool isCurrentThread() const noexcept { return getID() == getRunningID(); }


protected:
	static volatile bool is_shutdown;

	struct WaitVariable;
	friend PoolCPUShaders;

	// Thread process function.
	virtual void process() = 0;

	// Puts the thread into the waiting state.
	void wait();

	#ifdef _WIN32
		static unsigned long __stdcall thread_handler(void *data);
		void *thread;
	#else
		static void *thread_handler(void *data);
		pthread_t thread;
		pthread_mutex_t mutex;
	#endif

	volatile bool running{false};
	volatile bool is_waiting{false};
	volatile bool clean_stopped; // set to 1 by thread_handler() on clean exit from process()
	mutable volatile bool need_wait{false};

	long long affinity_mask{0};
	mutable int priority{0};
	ID thread_id;
	WaitVariable *wait_variable{nullptr};
	volatile char run_mutex{0};

private:
	static Thread::ID thread_main_id;
	static Thread::ID thread_gpu_stream_id;
	static Thread::ID thread_file_stream_id;
	static Thread::ID thread_async_id;
	static Thread::ID thread_background_id;
	static Thread::ID async_render_id;
};

//////////////////////////////////////////////////////////////////////////
/// Mutex Spin Lock
//////////////////////////////////////////////////////////////////////////

class BackoffSpinner
{
public:
	UNIGINE_INLINE void spin() noexcept
	{
		if (backoff >= yield_threshold)
		{
			Thread::switchThread();
		} else
		{
			int n = (1 << (backoff > max_exponent ? max_exponent : backoff));
			for (int i = 0; i < n; ++i)
				_mm_pause();
			++backoff;
		}
	}
private:
	static constexpr int yield_threshold = 31;
	static constexpr int max_exponent = 7;
	unsigned char backoff{0};
};

/// Spinlock, based on atomic CAS.
/// Now with unlocked dirty reads, proper waits, and exponential backoff.
template<typename Type>
UNIGINE_INLINE void SpinLockTepmlate(volatile Type *ptr, const Type old_value, const Type new_value) noexcept
{
	BackoffSpinner spinner;
	while (AtomicCAS(ptr, old_value, new_value) == false)
	{
		do
		{
			spinner.spin();
		} while (AtomicGet(ptr) != old_value);
	}
}
UNIGINE_INLINE void SpinLock(volatile char *ptr, const char old_value, const char new_value) noexcept { return SpinLockTepmlate<char>(ptr, old_value, new_value); }
UNIGINE_INLINE void SpinLock(volatile short *ptr, const short old_value, const short new_value) noexcept { return SpinLockTepmlate<short>(ptr, old_value, new_value); }
UNIGINE_INLINE void SpinLock(volatile int *ptr, const int old_value, const int new_value) noexcept { return SpinLockTepmlate<int>(ptr, old_value, new_value); }
UNIGINE_INLINE void SpinLock(volatile long long *ptr, const long long old_value, const long long new_value) noexcept { return SpinLockTepmlate<long long>(ptr, old_value, new_value); }

/// Waits for, but does not acquire the lock.
UNIGINE_INLINE void WaitLock(volatile char *ptr, const char value) noexcept { return SpinLock(ptr, value, value); }
UNIGINE_INLINE void WaitLock(volatile short *ptr, const short value) noexcept { return SpinLock(ptr, value, value); }
UNIGINE_INLINE void WaitLock(volatile int *ptr, const int value) noexcept { return SpinLock(ptr, value, value); }
UNIGINE_INLINE void WaitLock(volatile long long *ptr, const long long value) noexcept { return SpinLock(ptr, value, value); }

template<typename Type>
UNIGINE_INLINE void MutexSpinLock(volatile Type &mutex) noexcept { SpinLock(&mutex, 0, 1); }
template<typename Type>
UNIGINE_INLINE bool MutexSpinTryLock(volatile Type &mutex) noexcept { return AtomicCAS(&mutex, 0, 1); }
template<typename Type>
UNIGINE_INLINE void MutexSpinUnlock(volatile Type &mutex) noexcept { AtomicSet(&mutex, 0); }
template<typename Type>
UNIGINE_INLINE bool MutexSpinIsLocked(volatile Type &mutex) noexcept { return AtomicGet(&mutex) != 0; }
template<typename Type>
UNIGINE_INLINE void MutexSpinWaitLock(volatile Type &mutex) noexcept { SpinLock(&mutex, 0, 0); }

template<typename Type>
class ScopedSpinLockInteger
{
public:
	UNIGINE_INLINE ScopedSpinLockInteger(volatile Type &m): mutex(m) { SpinLock(&mutex, 0, 1); }
	UNIGINE_INLINE ~ScopedSpinLockInteger() noexcept { AtomicSet(&mutex, 0); }
private:
	volatile Type &mutex;
};
using ScopedSpinLockChar = ScopedSpinLockInteger<char>;
using ScopedSpinLockShort = ScopedSpinLockInteger<short>;
using ScopedSpinLockInt = ScopedSpinLockInteger<int>;
using ScopedSpinLockLongLong = ScopedSpinLockInteger<long long>;

using ScopedSpinLock8 = ScopedSpinLockInteger<char>;
using ScopedSpinLock16 = ScopedSpinLockInteger<short>;
using ScopedSpinLock32 = ScopedSpinLockInteger<int>;
using ScopedSpinLock64 = ScopedSpinLockInteger<long long>;

template<typename MutexType>
class ScopedMutexLock
{
public:
	UNIGINE_INLINE ScopedMutexLock(MutexType &m): mutex(m) { mutex.lock(); }
	UNIGINE_INLINE ~ScopedMutexLock() noexcept { mutex.unlock(); }
private:
	MutexType &mutex;
};

/// Scoped reader lock, based on RW-mutex.
template<typename MutexType>
class ScopedMutexReaderLock
{
public:
	UNIGINE_INLINE ScopedMutexReaderLock(MutexType &m): mutex(m) { mutex.lockRead(); }
	UNIGINE_INLINE ~ScopedMutexReaderLock() noexcept { mutex.unlockRead(); }
private:
	MutexType &mutex;
};

/// Scoped writer lock, based on RW-mutex.
template<typename MutexType>
class ScopedMutexWriterLock
{
public:
	UNIGINE_INLINE ScopedMutexWriterLock(MutexType &m): mutex(m) { mutex.lockWrite(); }
	UNIGINE_INLINE ~ScopedMutexWriterLock() noexcept { mutex.unlockWrite(); }
private:
	MutexType &mutex;
};


//////////////////////////////////////////////////////////////////////////
/// ReentrantMutex
//////////////////////////////////////////////////////////////////////////
template<typename MutexType>
class ReentrantMutexBase
{
public:
	ReentrantMutexBase() = default;

	UNIGINE_INLINE void lock() noexcept
	{
		auto id = AtomicGet(&thread_id);

		// C style cast, because static_cast doesn't work for PS5 & reinterpreter cast doesn't for work win32
		if (id != LLONG_MAX && id == (long long)(Thread::getID()))
		{
			++depth;
			assert(depth > 0); // Overflow check.
		} else
		{
			mutex.lock();
			AtomicSet(&thread_id, (long long)(Thread::getID()));
		}
	}
	UNIGINE_INLINE bool tryLock() noexcept
	{
		auto id = AtomicGet(&thread_id);

		// C style cast, because static_cast doesn't work for PS5 & reinterpreter cast doesn't for work win32
		if (id != LLONG_MAX && id == (long long)(Thread::getID()))
		{
			++depth;
			assert(depth > 0); // Overflow check.
		} else
		{
			if (!mutex.tryLock())
				return false;
			AtomicSet(&thread_id, (long long)(Thread::getID()));
		}
		return true;
	}
	UNIGINE_INLINE void unlock() noexcept
	{
		if (depth > 0)
		{
			--depth;
		} else
		{
			AtomicSet(&thread_id, LLONG_MAX);
			mutex.unlock();
		}
	}

	bool isLocked() { return AtomicGet(&thread_id) == LLONG_MAX; }

	void waitForce()
	{
		lock();
		unlock();
	}
	void wait()
	{
		auto id = AtomicGet(&thread_id);
		if (id == LLONG_MAX || id == (long long)(Thread::getID()))
			return;
		waitForce();
	}

protected:
	volatile long long thread_id{LLONG_MAX};
	volatile int depth{0};
	MutexType mutex;
};

//////////////////////////////////////////////////////////////////////////
/// Mutex Spin Lock
//////////////////////////////////////////////////////////////////////////

/// Simple mutex, based on atomic CAS (SpinLock).
class MutexSpin
{
public:
	MutexSpin() = default;
	UNIGINE_INLINE void lock() noexcept { SpinLock(&is_locked, 0, 1); }
	UNIGINE_INLINE bool tryLock() noexcept { return AtomicCAS(&is_locked, 0, 1); }
	UNIGINE_INLINE void unlock() noexcept { AtomicSet(&is_locked, 0); }
	UNIGINE_INLINE bool isLocked() const noexcept { return AtomicGet(&is_locked) != 0; }
	UNIGINE_INLINE void wait() noexcept { SpinLock(&is_locked, 0, 0); }
private:
	mutable volatile char is_locked{0};
};
using ScopedSpinLock = ScopedMutexLock<MutexSpin>;

//////////////////////////////////////////////////////////////////////////
/// Reentrant Mutex Spin Lock
//////////////////////////////////////////////////////////////////////////

/// Reentrant mutex spin lock.
/// May be locked multiply times by the same thread.
/// Must be unlocked corresponding number of times.
using ReentrantMutexSpin = ReentrantMutexBase<MutexSpin>;
static_assert(sizeof(ReentrantMutexSpin) == 16, "Must be equal!");

using ScopedReentrantSpinLock = ScopedMutexLock<ReentrantMutexSpin>;

//////////////////////////////////////////////////////////////////////////
/// RW Mutex Spin Lock
//////////////////////////////////////////////////////////////////////////

/// Write-preferring readers-writer mutex spin lock.
class RWMutexSpin
{
public:
	RWMutexSpin() = default;

	UNIGINE_INLINE void lockRead() noexcept
	{
		BackoffSpinner spinner;
		while (true)
		{
			while (AtomicGet(&writer_lock))
				spinner.spin();

			AtomicInc(&readers_counter);
			if (AtomicGet(&writer_lock) == 0)
				break;
			AtomicDec(&readers_counter);
		}
	}
	UNIGINE_INLINE bool tryLockRead() noexcept
	{
		if (AtomicGet(&writer_lock))
			return false;

		AtomicInc(&readers_counter);
		if (AtomicGet(&writer_lock) == 0)
			return true;

		AtomicDec(&readers_counter);
		return false;
	}
	UNIGINE_INLINE void unlockRead() noexcept { AtomicDec(&readers_counter); }

